In [1]:
import pandas as pd

In [2]:
wholesale_prices = pd.read_csv("./cleaned/super_dataframe.csv",encoding = "latin")
rainfall = pd.read_csv("pr_1991_2016_GHA.csv")
temperature = pd.read_csv("Monthly Average Temperature in Ghana.csv")
temperature_2 = pd.read_csv("tas_1991_2016_GHA.csv")

In [3]:
#Month array for extracting integer representations (index + 1)
month_array = {
    'JANUARY':1,
    'FEBRUARY':2,
    'MARCH':3,
    'APRIL':4,
    'MAY':5,
    'JUNE':6,
    'JULY':7,
    'AUGUST':8,
    'SEPTEMBER':9,
    'OCTOBER':10,
    'NOVEMBER':11,
    'DECEMBER':12,
    'Jan':1,
    'Feb':2,
    'Mar':3,
    'Apr':4,
    'May':5,
    'Jun':6,
    'Jul':7,
    'Aug':8,
    'Sep':9,
    'Oct':10,
    'Nov':11,
    'Dec':12
}

#### Wholesale Prices Quick Analysis

In [4]:
wholesale_prices.head()

   Unnamed: 0  Commodity  Year  Month   Price
0           0          6  1970      1  0.0005
1           1          6  1971      1  0.0007
2           2          6  1972      1  0.0008
3           3          6  1973      1   0.001
4           4          6  1974      1  0.0011

In [5]:
wholesale_prices.columns = wholesale_prices.columns.str.strip()

In [6]:
wholesale_prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3456 entries, 0 to 3455
Data columns (total 5 columns):
Unnamed: 0    3456 non-null int64
Commodity     3456 non-null int64
Year          3456 non-null int64
Month         3456 non-null int64
Price         3456 non-null object
dtypes: int64(4), object(1)
memory usage: 135.1+ KB

In [7]:
#wholesale_prices['MONTH'] = wholesale_prices.MONTH.map(month_array)

In [8]:
wholesale_prices.head(12)

    Unnamed: 0  Commodity  Year  Month   Price
0            0          6  1970      1  0.0005
1            1          6  1971      1  0.0007
2            2          6  1972      1  0.0008
3            3          6  1973      1   0.001
4            4          6  1974      1  0.0011
5            5          6  1975      1  0.0014
6            6          6  1976      1  0.0021
7            7          6  1977      1  0.0051
8            8          6  1978      1  0.0086
9            9          6  1979      1  0.0124
10          10          6  1980      1  0.0129
11          11          6  1981      1  0.0312

Merge Year and Month columns into date-time format:

In [9]:
wholesale_prices['Date'] = pd.to_datetime(wholesale_prices[['Year', 'Month']].assign(Day=1))
#wholesale_prices = wholesale_prices.set_index('Date')

In [10]:
wholesale_prices.head(12)

    Unnamed: 0  Commodity  Year  Month   Price       Date
0            0          6  1970      1  0.0005 1970-01-01
1            1          6  1971      1  0.0007 1971-01-01
2            2          6  1972      1  0.0008 1972-01-01
3            3          6  1973      1   0.001 1973-01-01
4            4          6  1974      1  0.0011 1974-01-01
5            5          6  1975      1  0.0014 1975-01-01
6            6          6  1976      1  0.0021 1976-01-01
7            7          6  1977      1  0.0051 1977-01-01
8            8          6  1978      1  0.0086 1978-01-01
9            9          6  1979      1  0.0124 1979-01-01
10          10          6  1980      1  0.0129 1980-01-01
11          11          6  1981      1  0.0312 1981-01-01

In [11]:
wholesale_prices.Commodity.unique()

array([6, 3, 1, 2, 4, 5])

In [12]:
#Export to CSV
#wholesale_prices.to_csv("./cleaned/wholesale_prices.csv")

In [13]:
# wholesale_prices_per_year = wholesale_prices.groupby('YEAR')['PRICE, ¢ GH'].mean()

In [14]:
# wholesale_prices_per_year.head()

### Temperature stuff

In [15]:
temperature.head()

   Temperature (C)  \tYear   Month  Country
0        25.326168    1901       1      GHA
1        28.642990    1901       2      GHA
2        28.397196    1901       3      GHA
3        28.612148    1901       4      GHA
4        27.476635    1901       5      GHA

In [16]:
temperature.columns = temperature.columns.str.strip()

In [17]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1344 entries, 0 to 1343
Data columns (total 4 columns):
Temperature (C)    1344 non-null float64
Year               1344 non-null int64
Month              1344 non-null int64
Country            1344 non-null object
dtypes: float64(1), int64(2), object(1)
memory usage: 42.1+ KB

In [18]:
temperature['Date'] = pd.to_datetime(temperature[['Year', 'Month']].assign(Day=1))
#temperature = temperature.set_index('Date')

In [19]:
temperature.head()

   Temperature (C)  Year  Month Country       Date
0        25.326168  1901      1     GHA 1901-01-01
1        28.642990  1901      2     GHA 1901-02-01
2        28.397196  1901      3     GHA 1901-03-01
3        28.612148  1901      4     GHA 1901-04-01
4        27.476635  1901      5     GHA 1901-05-01

In [20]:
temperature_2.columns = temperature_2.columns.str.strip()

In [21]:
temperature_2.head()

   Temperature - (Celsius)  Year Month Country  ISO3
0                  27.5450  1991   Jan   Ghana   GHA
1                  29.6491  1991   Feb   Ghana   GHA
2                  29.7984  1991   Mar   Ghana   GHA
3                  28.6725  1991   Apr   Ghana   GHA
4                  27.4803  1991   May   Ghana   GHA

In [22]:
temperature_2 = temperature_2.rename(columns={'Temperature - (Celsius)':'Temperature (C)'})

In [23]:
temperature_2['Month'] = temperature_2.Month.str.strip()

In [24]:
temperature_2['Month'] = temperature_2.Month.map(month_array)

In [25]:
temperature_2.head()

   Temperature (C)  Year  Month Country  ISO3
0          27.5450  1991      1   Ghana   GHA
1          29.6491  1991      2   Ghana   GHA
2          29.7984  1991      3   Ghana   GHA
3          28.6725  1991      4   Ghana   GHA
4          27.4803  1991      5   Ghana   GHA

In [26]:
temperature.tail()

      Temperature (C)  Year  Month Country       Date
1339        25.499090  2012      8     GHA 2012-08-01
1340        26.038181  2012      9     GHA 2012-09-01
1341        26.902729  2012     10     GHA 2012-10-01
1342        27.850910  2012     11     GHA 2012-11-01
1343        26.496363  2012     12     GHA 2012-12-01

In [27]:
temperature_2_above = temperature_2[temperature_2.Year > 2012]

In [28]:
temperature_2_above['Date'] = pd.to_datetime(temperature_2_above.loc[:,['Year', 'Month']].assign(Day=1))
#temperature_2_above = temperature_2_above.set_index('DATE')

/home/kayo-mest/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [29]:
temperature_2_above.drop(['Country', 'ISO3'], axis=1, inplace=True)
temperature.drop(['Country'], axis=1, inplace=True);

/home/kayo-mest/.local/lib/python3.6/site-packages/pandas/core/frame.py:3697: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [30]:
temperature_2_above.tail()

     Temperature (C)  Year  Month       Date
307          26.1849  2016      8 2016-08-01
308          26.5365  2016      9 2016-09-01
309          27.8165  2016     10 2016-10-01
310          28.5242  2016     11 2016-11-01
311          28.0134  2016     12 2016-12-01

In [31]:
temperature.tail()

      Temperature (C)  Year  Month       Date
1339        25.499090  2012      8 2012-08-01
1340        26.038181  2012      9 2012-09-01
1341        26.902729  2012     10 2012-10-01
1342        27.850910  2012     11 2012-11-01
1343        26.496363  2012     12 2012-12-01

In [32]:
full_temp = pd.concat([temperature, temperature_2_above])

In [33]:
full_temp.tail()

     Temperature (C)  Year  Month       Date
307          26.1849  2016      8 2016-08-01
308          26.5365  2016      9 2016-09-01
309          27.8165  2016     10 2016-10-01
310          28.5242  2016     11 2016-11-01
311          28.0134  2016     12 2016-12-01

In [34]:
temperature_df = full_temp.drop(['Year','Month'], axis=1)
temperature_df = temperature_df.set_index('Date');

In [35]:
temperature_df.head()

            Temperature (C)
Date
1901-01-01        25.326168
1901-02-01        28.642990
1901-03-01        28.397196
1901-04-01        28.612148
1901-05-01        27.476635

In [36]:
arr = wholesale_prices.Commodity.unique()

## Split and Merge

#### Split

In [37]:
#Prices split according to commodity type
split_df = {}

In [38]:
for item in arr:
    split_df.update({item:wholesale_prices[wholesale_prices.Commodity==item]})

In [39]:
for item in split_df.keys():
    split_df[item] = split_df[item].set_index('Date')

In [40]:
split_df[list(split_df.keys())[0]].head()

            Unnamed: 0  Commodity  Year  Month   Price
Date
1970-01-01           0          6  1970      1  0.0005
1971-01-01           1          6  1971      1  0.0007
1972-01-01           2          6  1972      1  0.0008
1973-01-01           3          6  1973      1   0.001
1974-01-01           4          6  1974      1  0.0011

In [41]:
temperature_df.head()

            Temperature (C)
Date
1901-01-01        25.326168
1901-02-01        28.642990
1901-03-01        28.397196
1901-04-01        28.612148
1901-05-01        27.476635

In [42]:
for item in arr:
    split_df[item] = pd.merge(split_df[item], temperature_df, left_index=True, right_index=True)

In [43]:
# drop date index
for item in split_df.keys():
    split_df[item] = split_df[item].reset_index(drop=True)

In [44]:
# stack DFs with concat
wholesale_prices_with_temp = pd.concat([sub_df for sub_df in split_df.values()])

In [45]:
wholesale_prices_with_temp.Commodity.unique()

array([6, 3, 1, 2, 4, 5])

In [46]:
wholesale_prices_with_temp.head()

   Unnamed: 0  Commodity  Year  Month   Price  Temperature (C)
0           0          6  1970      1  0.0005        27.457943
1           1          6  1971      1  0.0007        26.135513
2           2          6  1972      1  0.0008        26.640186
3           3          6  1973      1   0.001        27.311214
4           4          6  1974      1  0.0011        26.189718

In [47]:
wholesale_prices_with_temp.tail()

     Unnamed: 0  Commodity  Year  Month   Price  Temperature (C)
559        3450          5  2012     12   218.9        26.496363
560        3451          5  2013     12   249.3        26.794700
561        3452          5  2014     12     268        27.092500
562        3453          5  2015     12  345.17        26.499300
563        3454          5  2016     12  424.69        28.013400

### Rainfall

In [48]:
rainfall.head()

   Rainfall - (MM)   Year  Month  Country  ISO3
0          9.81577   1991    Jan    Ghana   GHA
1         39.20720   1991    Feb    Ghana   GHA
2         67.82510   1991    Mar    Ghana   GHA
3        134.44000   1991    Apr    Ghana   GHA
4        236.53400   1991    May    Ghana   GHA

In [49]:
rainfall.columns = rainfall.columns.str.strip()

In [50]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 5 columns):
Rainfall - (MM)    312 non-null float64
Year               312 non-null int64
Month              312 non-null object
Country            312 non-null object
ISO3               312 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 12.3+ KB

In [51]:
rainfall['Month'] = rainfall.Month.str.strip()

In [52]:
rainfall['Month'] = rainfall.Month.map(month_array)

In [53]:
rainfall.head()

   Rainfall - (MM)  Year  Month Country  ISO3
0          9.81577  1991      1   Ghana   GHA
1         39.20720  1991      2   Ghana   GHA
2         67.82510  1991      3   Ghana   GHA
3        134.44000  1991      4   Ghana   GHA
4        236.53400  1991      5   Ghana   GHA

In [54]:
rainfall.drop(['Country','ISO3'], axis=1, inplace=True)

In [55]:
rainfall.head()

   Rainfall - (MM)  Year  Month
0          9.81577  1991      1
1         39.20720  1991      2
2         67.82510  1991      3
3        134.44000  1991      4
4        236.53400  1991      5

In [56]:
rainfall['Date'] = pd.to_datetime(rainfall[['Year', 'Month']].assign(Day=1))
rainfall = rainfall.set_index('Date')

In [57]:
rainfall.head()

            Rainfall - (MM)  Year  Month
Date
1991-01-01          9.81577  1991      1
1991-02-01         39.20720  1991      2
1991-03-01         67.82510  1991      3
1991-04-01        134.44000  1991      4
1991-05-01        236.53400  1991      5

In [58]:
#Drop year and month from Rainfall
rainfall.drop(['Year','Month'],axis=1, inplace=True)

### Split and merge

In [59]:
wholesale_prices_with_temp['Date'] = pd.to_datetime(wholesale_prices_with_temp[['Year', 'Month']].assign(Day=1))

In [60]:
#Prices split according to commodity type
split_df = {}

In [61]:
for item in arr:
    split_df.update({item:wholesale_prices_with_temp[wholesale_prices_with_temp.Commodity==item]})

In [62]:
for item in split_df.keys():
    split_df[item] = split_df[item].set_index('Date')

In [63]:
split_df[list(split_df.keys())[0]].head()

            Unnamed: 0  Commodity  Year  Month   Price  Temperature (C)
Date
1970-01-01           0          6  1970      1  0.0005        27.457943
1971-01-01           1          6  1971      1  0.0007        26.135513
1972-01-01           2          6  1972      1  0.0008        26.640186
1973-01-01           3          6  1973      1   0.001        27.311214
1974-01-01           4          6  1974      1  0.0011        26.189718

In [64]:
rainfall.head()

            Rainfall - (MM)
Date
1991-01-01          9.81577
1991-02-01         39.20720
1991-03-01         67.82510
1991-04-01        134.44000
1991-05-01        236.53400

In [65]:
for item in arr:
    split_df[item] = pd.merge(split_df[item], rainfall, left_index=True, right_index=True)

In [66]:
for item in split_df.keys():
    split_df[item] = split_df[item].reset_index(drop=True)

In [67]:
# stack DFs with concat
wholesale_prices_with_temp_and_rainfall = pd.concat([sub_df for sub_df in split_df.values()])

In [68]:
#wholesale_prices_with_temp_and_rainfall = pd.merge(wholesale_prices_with_temp, rainfall, left_index=True, right_index=True)

In [69]:
wholesale_prices_with_temp_and_rainfall.head()

,Unnamed: 0,Commodity,Year,Month,Price,Temperature (C),Rainfall - (MM)
0,21,6,1991,1,0.9003,27.671963,9.81577
1,22,6,1992,1,0.685,26.237385,0.39923
2,23,6,1993,1,1.0532,26.123363,2.41567
3,24,6,1994,1,1.088,27.050467,7.48651
4,25,6,1995,1,2.012,26.719625,0.57606

In [70]:
wholesale_prices_with_temp_and_rainfall.drop('Unnamed: 0', axis=1)
wholesale_prices_with_temp_and_rainfall.head()

,Unnamed: 0,Commodity,Year,Month,Price,Temperature (C),Rainfall - (MM)
0,21,6,1991,1,0.9003,27.671963,9.81577
1,22,6,1992,1,0.685,26.237385,0.39923
2,23,6,1993,1,1.0532,26.123363,2.41567
3,24,6,1994,1,1.088,27.050467,7.48651
4,25,6,1995,1,2.012,26.719625,0.57606

In [71]:
wholesale_prices_with_temp_and_rainfall.to_csv('./cleaned/wholesale_prices_with_temp_and_rainfall.csv')